Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q19.PIC
      <edc:SFRDef edc:_addr="0x40034028" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:cname="MCAN1_TOCC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ETOC" edc:desc="Enable Timeout Counter" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEOUT" edc:desc="Timeout Counter disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TOS_CONTROLLED" edc:desc="Timeout Counter enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TOS" edc:desc="Timeout Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous operation" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TX_EV_TIMEOUT" edc:desc="Timeout controlled by Tx Event FIFO" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RX0_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RX1_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:desc="Timeout Period" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003402C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="MCAN1_TOCV" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TOC" edc:desc="Timeout Counter (cleared on write)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40034030" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40034040" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MCAN1_ECR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEC" edc:desc="Transmit Error Counter" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Receive Error Counter" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="Receive Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:desc="CAN Error Logging (cleared on read)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034044" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="MCAN1_PSR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEC" edc:desc="Last Error Code (set to 111 on read)" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_ERROR" edc:desc="No error occurred since LEC has been reset by successful reception or transmission." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STUFF_ERROR" edc:desc="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FORM_ERROR" edc:desc="A fixed format part of a received frame has the wrong format." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACK_ERROR" edc:desc="The message transmitted by the MCAN was not acknowledged by another node." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="BIT1_ERROR" edc:desc="During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="BIT0_ERROR" edc:desc="During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CRC_ERROR" edc:desc="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="NO_CHANGE" edc:desc="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:desc="Activity" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONIZING" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVER" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMITTER" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLEC" edc:desc="Fast Last Error Code (set to 111 on read)" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="RESI" edc:desc="ESI Flag of Last Received CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:desc="BRS Flag of Last Received CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REDL" edc:desc="Received a CAN FD Message (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40034048" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40034050" edc:access="nnnnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_IR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:desc="Receive FIFO 0 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:desc="Receive FIFO 0 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:desc="Receive FIFO 0 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:desc="Receive FIFO 0 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:desc="Receive FIFO 1 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:desc="Receive FIFO 1 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:desc="Receive FIFO 1 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Receive FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:desc="High Priority Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC" edc:desc="Transmission Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:desc="Transmission Cancellation Finished" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:desc="Tx FIFO Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:desc="Tx Event FIFO New Entry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:desc="Tx Event FIFO Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:desc="Tx Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:desc="Timestamp Wraparound" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:desc="Message RAM Access Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:desc="Timeout Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:desc="Message stored to Dedicated Receive Buffer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:desc="Error Logging Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:desc="Watchdog Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCE" edc:desc="CRC Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BE" edc:desc="Bit Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACKE" edc:desc="Acknowledge Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOE" edc:desc="Format Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STE" edc:desc="Stuff Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
