Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q19.PIC
      <edc:SFRDef edc:_addr="0x4004C02C" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IER" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C030" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C034" edc:access="----rrrr------rr-----r-------rr-" edc:cname="ISI_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Operation Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C038" edc:access="------------------------------ww" edc:cname="ISI_DMA_CHER" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P_CH_EN" edc:desc="Preview Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_EN" edc:desc="Codec Channel Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C03C" edc:access="------------------------------ww" edc:cname="ISI_DMA_CHDR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P_CH_DIS" edc:desc="Preview Channel Disable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_DIS" edc:desc="Codec Channel Disable Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C040" edc:access="------------------------------rr" edc:cname="ISI_DMA_CHSR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P_CH_S" edc:desc="Preview DMA Channel Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_S" edc:desc="Code DMA Channel Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C044" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_P_ADDR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_ADDR" edc:desc="Preview Image Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C048" edc:access="----------------------------nnnn" edc:cname="ISI_DMA_P_CTRL" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P_FETCH" edc:desc="Descriptor Fetch Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_WB" edc:desc="Descriptor Writeback Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_IEN" edc:desc="Transfer Done Flag Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_DONE" edc:desc="Preview Transfer Done" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C04C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_P_DSCR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_DSCR" edc:desc="Preview Descriptor Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C050" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_C_ADDR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_ADDR" edc:desc="Codec Image Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
