Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q19.PIC
      <edc:SFRDef edc:_addr="0x400E0F58" edc:access="----------------------------wwww" edc:cname="PIOA_PCIDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Parallel Capture Mode Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Parallel Capture Mode Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Reception Transfer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0F5C" edc:access="----------------------------rrrr" edc:cname="PIOA_PCIMR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Parallel Capture Mode Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Parallel Capture Mode Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Reception Transfer Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Reception Buffer Full Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0F60" edc:access="------------------------------rr" edc:cname="PIOA_PCISR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Parallel Capture Mode Data Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Parallel Capture Mode Overrun Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0F64" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIOA_PCRHR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDATA" edc:desc="Parallel Capture Mode Reception Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0F68" edc:offset="0x98"/>
      <edc:SFRDef edc:_addr="0x400E1000" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOB_PER" edc:nzwidth="0x20" ltx:memberofperipheral="PIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1004" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOB_PDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
