Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="DATRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA8" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CANTX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CANRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DCD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWR0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MCCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
    </edc:Pin>
